
// 주제: 변수를 선언할 때 자료형의 역할에 대해서 살펴보자.

// 자료형의 역할 2가지

public class Data04 {
	public static void main(String[] args) {
		/*
		 *  변수 메모리 선언 문법
		 *  	자료형 변수이름;
		 */
		
		/*
		 *	결론 1. 첫 번째 이유는 변수 메모리에 저장되는 값의 형태를 결정하기 때문에
		 *			변수를 선언할 때 자료형의 종류를 적절하게 선택해서 변수를 서언해야 한다.
		 */
		
		// 소수점이 없는 값 1을 선언한 변수 a에 저장하기 위해서는 
		// int 자료형으로 a라는 이름의 변수를 선언해야 한다.
		int a;
		a = 1;
		
		// 소수점이 있는 값 2.4는 선언한 변수 m에 저장하기 위해서는
		// double 자료형으로 변수를 선언해야 한다.
		double m = 2.4;
		
		// 만일 변수 k에 참, 거짓 논리값 중 하나를 저장하기 위해서는
		// boolean 자료형으로 변수를 선언해야 한다.
		boolean k = true;
		
		
		//-----------------------------------------------------------------------------------------
		/*
		 * 결론 2.
		 * 변수를 선언할 때 자료형을 사용하는데는 크게 2가지의 이유가 있다.
		 * 
		 * 두 번째 이유는 변수 메모리의 사이즈(크기)를 결정하는데
		 * 변수 메모리에 할당되는 사이즈에 다라 저장할 수 있는 값의 허용 범위가 달라진다.
		 * 
		 * 정수 값을 저장하기 위해서는 자료형이 4가지(byte, short, int, long)나 되는
		 * 이유도 이 때문이다.
		 */
		
		// 변수 b를 byte 자료형으로 선언했다면?
//		byte b;
		
		// -128 ~ 127 사이의 값만 저장이 가능하기 때문에 128과 같이
		// 허용 범위를 넘어서는 값을 저장하게 되면 컴파일 에러가 발생하게 된다.
//		b = 128;
		
		// 만일 128을 저장하려면 short 자료형르로는 b라는 이름의 변수 메모리를 선언(생성) 해야한다.
//		short b = 128; // short 자료형 허용범위의 값(-32768 ~ 32767 사이의 값)만 b 메모리에 저장

//		b = 32768;

		// 만일 32768 정수를 변수에 저장하려면
		// int 자료형으로 변수 메모리를 선언(생성)해야 한다.
		int c = 32768; // int 자료형은 허용 범위 값(-2의 31승 ~ 2의 31승 -1 사이의 값)만
		   			   // 							(-2,147,483,648 ~ 2,147,483,647)
		   			   //  							(약 -2.14억 ~ 약 +2.14억)
					   // 변수 c 메모리에 저장 가능하다.
		
		// 정수형 상수 중에서 접미사 L이 붙은 long 자료형(8Byte 메모리 크기) 상수이므로
		// int 자료형(4바이트 메모리 크기) 변수 d에 저장하면 컴파일 에러가 발생한다.
//		int d = 123456L;
		
		// 그러므로 반드시 long 자료형으로 변수 d를 선언해서 저장해야 한다.
		long d = 123456L;
		
		/*
		 * long 자료형의 허용 범위
		 * 최솟값 : -2의 63승
		 * 			약 -9.22 경
		 * 
		 * 최댓값 : 2의 63승 -1
		 * 			약 +9.22경
		 */
		
		
		
	}
}



















